
#1) input() არის ფუნქცია, რომელიც გვაძლევს საშუალებას მომხმარებლისგან მივიღოთ ინფორმაცია.
# როცა input() იძახება პროგრამა  ელოდება, სანამ მომხმარებელი კლავიატურიდან რაღაცას შეიყვანს.

# 2)
# + (დამატება)
# აერთიანებს ორ რიცხვს და აბრუნებს მათ ჯამს

# - (გამოკლება)
# ერთ რიცხვს აკლებს მეორეს

# * (გამრავლება)
# ამრავლებს ორ რიცხვს ერთმანეთზე

# / (გაყოფა)
# ყოფს ერთ რიცხვს მეორეზე (პასუხი ყოველთვის ათწილადია)

# // (მთელი გაყოფა)
# ყოფს და აბრუნებს მხოლოდ მთელ ნაწილს (ათწილადის გარეშე)

# % (ნაშთი)
# გაყოფის შემდეგ აბრუნებს ნაშთს

# ** (ხარისხში აყვანა)
# რიცხვს აჰყავს ხარისხში

# 3) მომხმარებელს შემოატანინეთ მისი სახელი, გვარი, ასაკი და საყვარელი რიცხვი, შემდგომ გამოიტანეთ ყველაფერი ტერმინალში

num1 = input('ჩაწერეთ თქვენი სახელი:')
num2 = input('ჩაწერეთ თქვენი გვარი:')
num3 = input('ჩაწერეთ თქვენი ასაკი:')
num4 = input('ჩაწერეთ თქვენი საყვარელი რიცხვი:')
print('name: ', num1)
print('last name: ', num2)
print('age: ', num3)
print('favorite number: ', num4)


# 4) შემოაყვანინეთ მომხმარებელს 3 რიცხვი, შემდგომ გამოიტანეთ ტერმინალში ამ რიცხვებს შორის ყველა მათემატიკური ოპერაციის შედეგი.
num1 = int(input("შეიყვანე პირველი რიცხვი:"))
num2 = int(input('შეიყვანე მეორე რიცხვი:'))
num3 = int(input('შეიყვანე მესამე რიცხვი:'))
print("+:",num1 + num2 + num3)
print("-:",num1 - num2 - num3)
print("*:",num1 * num2 * num3)
print("/:",num1 / num2 / num3)
print("**:",num1 ** num2 ** num3)
print("//:",num1 // num2 // num3)







# 5) კომენტარების სახით ახსენით რითი განსხვავდება frontend - ი backend - ისგან.
# 6) sololearn: (courses -> programming languages -> introduction to python)