# 1) ახსენით რას ნიშნავს high level და low level პროგრამირების ენა.
#higt level ახლოს არის ადამიანურ ენასთან და low level უფრო ახლოს არის ორობით კოდთან
# 2) ჩამოთვალეთ მონაცემთა ტიპები და განმარტეთ თითოეული მათგანი.
#string - ტექსტური მონაცემი, int - მთელი რიცხვი , float - წილადი რიცხვი, bool - True and False. 


# 3) ახსენით რას აკეთებს ფუნქცია print().

# print()-ტერმინალში ასახავს იმ მონაცემს რაც მივუთითეთ ბრჭყალებში


# 4) შექმენით 4 ცვლადი თქვენი სახელით, გვარით, ასაკით და საყვარელი ფერით, შემდგომ გამოიტანეთ ეს ყველაფერი ტერმინალში.

name = "Anri"
surname = "Markhulia"
age = 18
favcolor = 'black'
print(name, surname, 18)
print(favcolor)






# 5) გაასწორეთ შემდეგი კოდი:

name = 'Saba'

age = 16

print(name)
print(age)


